_posts/programming/2022-06-25-cppcoreguidelines-f44.html
---
layout: post
title: CppCoreGuidelines F.44 在不需要复制且无需返回空对象的时候返回引用 T&
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
F.44: Return a <code>T&amp;</code> when copy is undesirable and “returning no object” isn’t needed
</p>

<p>
<b>理由</b>
</p>

<p>
编程语言会确保<code>T&amp;</code>一定指向某个对象。所以不需要测试<code>T&amp;</code>的值是否为 <code>nullptr</code>
</p>

<p>
返回引用不转移所有权。
</p>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #3F7F5F;">// -*- compile-command: "g++ -std=c++20 code.cpp &amp;&amp; ./a"; -*-</span>
<span style="color: #7F0055; font-weight: bold;">#include</span> <span style="color: #2A00FF;">&lt;iostream&gt;</span>
<span style="color: #7F0055; font-weight: bold;">#include</span> <span style="color: #2A00FF;">&lt;array&gt;</span>
<span style="color: #7F0055; font-weight: bold;">#include</span> <span style="color: #2A00FF;">&lt;gsl/gsl&gt;</span>
<span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #7F0055; font-weight: bold;">namespace</span> std;
<span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #7F0055; font-weight: bold;">namespace</span> gsl;

<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">float</span> <span style="color: #000000; font-style: italic;">pressure</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">wheel</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">float</span> p <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099;">100</span><span style="color: #7388d6;">)</span>: <span style="color: #110099; font-style: italic;">pressure</span><span style="color: #7388d6;">(</span>p<span style="color: #7388d6;">){}</span>
    <span style="color: #7F0055; font-weight: bold;">friend</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">ostream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ostream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">o</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">w</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>;

<span style="color: #000000; font-style: italic; text-decoration: underline;">ostream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">ostream</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">o</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">w</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    o <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #2A00FF;">"wheel's pressure is "</span> <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> w.<span style="color: #110099; font-style: italic;">pressure</span> <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> endl;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Car</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">array</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span>, <span style="color: #110099;">4</span><span style="color: #7388d6; font-weight: bold;">&gt;</span> <span style="color: #000000; font-style: italic;">w</span>;
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">Car</span><span style="color: #7388d6;">(){}</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">get_wheel</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">i</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> <span style="color: #3a5fcd; font-weight: bold;">Expects</span><span style="color: #909183;">(</span>i <span style="color: #7F0055; font-weight: bold;">&lt;</span> w.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">size</span><span style="color: #709870;">()</span><span style="color: #909183;">)</span>; <span style="color: #7F0055; font-weight: bold;">return</span> w<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span>; <span style="color: #7388d6;">}</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">Car</span> <span style="color: #000000;">c</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">wheel</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">w0</span> <span style="color: #7F0055; font-weight: bold;">=</span> c.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">get_wheel</span><span style="color: #7388d6;">(</span><span style="color: #110099;">0</span><span style="color: #7388d6;">)</span>; <span style="color: #3F7F5F;">// w0 has the same lifetime as c</span>
    cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> w0;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold;">main</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #3a5fcd; font-weight: bold;">use</span><span style="color: #7388d6;">()</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #110099;">0</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<pre class="example">
wheel's pressure is 100
</pre>



<p>
<b>强化</b>
</p>
<ul class="org-ul">
<li>注意函数返回值是引用的话，函数是不可能返回 <code>nullptr</code> 的</li>
</ul>
